// Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. 
// Напишите программу, которая покажет количество чётных чисел в массиве.
// [345, 897, 568, 234] -> 2
void FillArray(int[] array)
{
    Random rnd = new Random();
    for (int i = 0; i < array.Length; i++)
    {
        array[i] = rnd.Next(100, 1000);
    }
}

void PrintArray(int[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($"{array[i]} ");
    }
}

int FindEvenNumber(int[] array)
{
    int count = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i]%2 == 0)
        {
            count++;
        }
    }
    return count;
}

System.Console.WriteLine("Введите длину массива");
int length = Convert.ToInt32(Console.ReadLine());
int[] mas = new int[length];
FillArray(mas);
PrintArray(mas);
System.Console.WriteLine();
int result = FindEvenNumber(mas);
System.Console.WriteLine($"В массиве {result} четных чисел");